ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_КлючиМоделей/АСМ_КлючиМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_КлючиМоделей</name>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БезМарки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезМаркиБезМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Совместимо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Модификации/АСМ_Модификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Модификации</name>
  <attributes>
    <name>ГодНачалаВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодОкончанияВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.АСМ_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоплива</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТоплива</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПривода</name>
    <type>
      <types>CatalogRef.АСМ_ТипыПривода</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТрансмиссии</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТрансмиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>CatalogRef.АСМ_Мощности</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийОбъем</name>
    <type>
      <types>CatalogRef.АСМ_Объемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.АСМ_ТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДверей</name>
    <type>
      <types>CatalogRef.АСМ_КоличествоДверей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_КлючиМоделей/ManagerModule.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыбранныеОпции(Ссылка) Экспорт

	ВыбранныеОпции = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючМодели", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
				   |	АСМ_КлючиМоделейКомплектации.Комплектация КАК Комплектация,
				   |	АСМ_МодификацииКомплектации.Ссылка КАК Модификация
				   |ПОМЕСТИТЬ ВТКомплектации
				   |ИЗ
				   |	Справочник.АСМ_КлючиМоделей.Комплектации КАК АСМ_КлючиМоделейКомплектации
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АСМ_Модификации.Комплектации КАК АСМ_МодификацииКомплектации
				   |		ПО АСМ_МодификацииКомплектации.Комплектация = АСМ_КлючиМоделейКомплектации.Комплектация
				   |ГДЕ
				   |	АСМ_КлючиМоделейКомплектации.Ссылка = &КлючМодели
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	АСМ_Модификации.ТипТоплива КАК ТипТоплива,
				   |	АСМ_Модификации.ТипПривода КАК ТипПривода,
				   |	АСМ_Модификации.ТипТрансмиссии КАК ТипТрансмиссии,
				   |	АСМ_Модификации.Мощность КАК Мощность,
				   |	АСМ_Модификации.РабочийОбъем КАК РабочийОбъем,
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_Модификации.ТипПривода.Наименование + "", "" + АСМ_Модификации.ТипТрансмиссии.Наименование + "", "" +
				   |		АСМ_Модификации.ТипТоплива.Наименование + "" ("" + АСМ_Модификации.РабочийОбъем.Наименование + ""л/"" +
				   |		АСМ_Модификации.Мощность.Наименование + ""л.с.)"" КАК Расшифровка
				   |ИЗ
				   |	ВТКомплектации КАК ВТКомплектации
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АСМ_Модификации КАК АСМ_Модификации
				   |		ПО ВТКомплектации.Модификация = АСМ_Модификации.Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	АСМ_Модификации.ТипКузова КАК ТипКузова,
				   |	АСМ_Модификации.КоличествоДверей КАК КоличествоДверей,
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_Модификации.ТипКузова.Наименование + "" ("" + АСМ_Модификации.КоличествоДверей.Наименование + "" дв.)"" КАК
				   |		Расшифровка
				   |ИЗ
				   |	ВТКомплектации КАК ВТКомплектации
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АСМ_Модификации КАК АСМ_Модификации
				   |		ПО ВТКомплектации.Модификация = АСМ_Модификации.Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_МодификацииКомплектации.Комплектация.Наименование КАК Наименование
				   |ИЗ
				   |	ВТКомплектации КАК ВТКомплектации
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АСМ_Модификации.Комплектации КАК АСМ_МодификацииКомплектации
				   |		ПО АСМ_МодификацииКомплектации.Ссылка = ВТКомплектации.Модификация
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	АСМ_Модификации.Поколение КАК Поколение
				   |ИЗ
				   |	ВТКомплектации КАК ВТКомплектации
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АСМ_Модификации КАК АСМ_Модификации
				   |		ПО ВТКомплектации.Модификация = АСМ_Модификации.Ссылка
				   |";
	ПакетОпций = Запрос.ВыполнитьПакет();

	ВыбранныеОпции.Вставить("Агрегаты", ПакетОпций[1].Выгрузить());
	ВыбранныеОпции.Вставить("ТипыКузовов", ПакетОпций[2].Выгрузить());
	ВыбранныеОпции.Вставить("Комплектации", ПакетОпций[3].Выгрузить());
	ВыбранныеОпции.Вставить("Поколения", ПакетОпций[4].Выгрузить());

	Возврат ВыбранныеОпции;

КонецФункции

#КонецОбласти

#КонецЕсли
